OpenNuvoton/M55M1BSP/SampleCode/StdDriver/CRYPTO_AES_GCM/main.c
        /* fill iv to output */
        for (i = 0; i < iv_len_aligned; i++)
        {
            if (i < iv_len)
                pbuf[i] = iv[i];
            else
                pbuf[i] = 0; // padding zero
        }

        /* fill iv len to putput */
        if (iv_len == 12)
        {
            pbuf[15] = 1;
            u32Offset += iv_len_aligned;
        }
        else
        {
            /* Padding zero. 64'bit 0 */
            memset(&pbuf[iv_len_aligned], 0, 8);

            /* 64'bitlen(IV) */
            pu8 = &pbuf[iv_len_aligned + 8];
            *((uint64_t *)pu8) = iv_len * 8;
            swap64(pu8);
            u32Offset += iv_len_aligned + 16;
        }
    }


    /* A Section = 128'align(A) */
    if (A_len > 0)
    {
        A_len_aligned = A_len;

        if (A_len & 0xful)
            A_len_aligned = ((A_len + 16) >> 4) << 4;

        for (i = 0; i < A_len_aligned; i++)
        {
            if (i < A_len)
                pbuf[u32Offset + i] = A[i];
            else
                pbuf[u32Offset + i] = 0; // padding zero
        }

        u32Offset += A_len_aligned;
    }

    /* P/C Section = 128'align(P/C) */
    if (P_len > 0)
    {
        P_len_aligned = P_len;

        if (P_len & 0xful)
            P_len_aligned = ((P_len + 16) >> 4) << 4;

        for (i = 0; i < P_len_aligned; i++)
        {
            if (i < P_len)
                pbuf[u32Offset + i] = P[i];
            else
                pbuf[u32Offset + i] = 0; // padding zero
        }

        u32Offset += P_len_aligned;
    }

    *psize = u32Offset;

    return 0;
}

void AES_Run(uint32_t u32Option)
{
    uint32_t u32TimeOutCnt;

    g_Crypto_Int_done = 0;
    CRYPTO->AES_CTL = u32Option | START;
    /* Waiting for AES calculation */
    u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */

    while (!g_Crypto_Int_done)
    {
        if (--u32TimeOutCnt == 0)
        {
            printf("Wait for AES calculation done time-out!\n");
            break;
        }
    }
}


int32_t AES_GCMEnc(uint8_t *key, uint32_t klen, uint8_t *iv, uint32_t ivlen, uint8_t *A, uint32_t alen, uint8_t *P, uint32_t plen, uint8_t *buf, uint32_t *size, uint32_t *plen_aligned)
{
    int32_t plen_cur;
    int32_t len;
    uint8_t *pin, *pout;
    int32_t i;
    uint32_t u32OptKeySize;
    uint32_t u32OptBasic;

    printf("\n");

    printf("key (%d):\n", klen);
    DumpBuffHex(key, klen);

    printf("IV (%d):\n", ivlen);
    DumpBuffHex(iv, ivlen);

    printf("A (%d):\n", alen);
    DumpBuffHex(A, alen);

    printf("P (%d):\n", plen);
    DumpBuffHex(P, plen);

    /* Prepare the key */
    memcpy(g_au8Buf, key, klen);
    ToBigEndian(g_au8Buf, klen);

    for (i = 0; i < klen / 4; i++)
    {
        CRYPTO->AES_KEY[i] = *((uint32_t *)&g_au8Buf[i * 4]);
    }

    /* Prepare key size option */
    i = klen >> 3;
    u32OptKeySize = (((i >> 2) << 1) | (i & 1)) << CRYPTO_AES_CTL_KEYSZ_Pos;

    /* Basic options for AES */
    u32OptBasic = CRYPTO_AES_CTL_ENCRYPTO_Msk | CRYPTO_AES_CTL_INSWAP_Msk | CRYPTO_AES_CTL_OUTSWAP_Msk | u32OptKeySize;


    /* Set byte count of IV */
    CRYPTO->AES_GCM_IVCNT[0] = ivlen;
    CRYPTO->AES_GCM_IVCNT[1] = 0;

    /* Set bytes count of A */
    CRYPTO->AES_GCM_ACNT[0] = alen;
    CRYPTO->AES_GCM_ACNT[1] = 0;
    /* Set bytes count of P */
    CRYPTO->AES_GCM_PCNT[0] = plen;
    CRYPTO->AES_GCM_PCNT[1] = 0;

    *plen_aligned = (plen & 0xful) ? ((plen + 16) / 16) * 16 : plen;

    if (plen <= GCM_PBLOCK_SIZE)
    {
        /* Just one shot */

        /* Prepare the blocked buffer for GCM */
        AES_GCMPacker(iv, ivlen, A, alen, P, plen, g_au8Buf, size);


        printf("input blocks (%d):\n", *size);
        DumpBuffHex(g_au8Buf, *size);

        AES_SetDMATransfer(CRYPTO, 0, (uint32_t)g_au8Buf, (uint32_t)buf, *size);

        AES_Run(u32OptBasic | GCM_MODE | DMAEN);

        printf("output blocks (%d):\n", *size);
        DumpBuffHex(buf, *size);
    }
    else
    {

        /* Process P block by block, DMA casecade mode */

        /* inital DMA for AES-GCM casecade */

        /* Prepare the blocked buffer for GCM */
        AES_GCMPacker(iv, ivlen, A, alen, 0, 0, g_au8Buf, size);

        printf("input blocks for casecade 0 (%d):\n", *size);
        DumpBuffHex(g_au8Buf, *size);

        AES_SetDMATransfer(CRYPTO, 0, (uint32_t)g_au8Buf, (uint32_t)buf, *size);
        /* feedback buffer is necessary for casecade mode */
        CRYPTO->AES_FBADDR = (uint32_t)&g_au8FeedBackBuf[0];

        AES_Run(u32OptBasic | GCM_MODE | FBOUT | DMAEN);

        /* Start to encrypt P data */
        printf("P Block size for casecade mode %d\n", GCM_PBLOCK_SIZE);
        plen_cur = plen;
        pin = P;
        pout = buf;

        while (plen_cur)
        {
            len = plen_cur;

            if (len > GCM_PBLOCK_SIZE)
            {
                len = GCM_PBLOCK_SIZE;
            }

            plen_cur -= len;

            /* Prepare the blocked buffer for GCM */
            memcpy(g_au8Buf, pin, len);

            /* padding 0 if necessary */
            if (len & 0xf)
            {
                memset(&g_au8Buf[len], 0, 16 - (len & 0xf));
                len = ((len + 16) >> 4) << 4;
            }

            printf("input blocks for casecade (%d):\n", len);
            DumpBuffHex(g_au8Buf, len);

            AES_SetDMATransfer(CRYPTO, 0, (uint32_t)g_au8Buf, (uint32_t)pout, len);



            if (plen_cur)
            {
                /* casecade n */
                AES_Run(u32OptBasic | GCM_MODE | FBIN | FBOUT | DMAEN | DMACC);
            }
            else
            {
                /* last casecade */
                AES_Run(u32OptBasic | GCM_MODE | FBIN | FBOUT | DMAEN | DMACC | DMALAST);
            }

            printf("output blocks (%d):\n", len);
            DumpBuffHex(pout, len);

            pin += len;
            pout += len;
        }

        /* Total size is plen aligment size + tag size */
        *size = *plen_aligned + 16;

    }

    return 0;
}

int32_t AES_GCMDec(uint8_t *key, uint32_t klen, uint8_t *iv, uint32_t ivlen, uint8_t *A, uint32_t alen, uint8_t *P, uint32_t plen, uint8_t *buf, uint32_t *size, uint32_t *plen_aligned)
{
    int32_t i, len, plen_cur;
    uint8_t *pin, *pout;
    uint32_t u32OptBasic;
    uint32_t u32OptKeySize;

    /* Prepare key size option */
    i = klen >> 3;
    u32OptKeySize = (((i >> 2) << 1) | (i & 1)) << CRYPTO_AES_CTL_KEYSZ_Pos;

    /* Basic options for AES */
    u32OptBasic = CRYPTO_AES_CTL_INSWAP_Msk | CRYPTO_AES_CTL_OUTSWAP_Msk | u32OptKeySize;

    printf("\n");
    printf("key (%d):\n", klen);
    DumpBuffHex(key, klen);

    printf("IV (%d):\n", ivlen);
    DumpBuffHex(iv, ivlen);

    printf("A (%d):\n", alen);
    DumpBuffHex(A, alen);

