OpenNuvoton/M55M1BSP/SampleCode/StdDriver/CRYPTO_AES_GCM/main.c
    /* Set AES Key */
    memcpy(g_au8Buf, key, klen);
    ToBigEndian(g_au8Buf, klen);

    for (i = 0; i < klen / 4; i++)
    {
        CRYPTO->AES_KEY[i] = *((uint32_t *)&g_au8Buf[i * 4]);
    }

    /* Set byte count of IV */
    CRYPTO->AES_GCM_IVCNT[0] = ivlen;
    CRYPTO->AES_GCM_IVCNT[1] = 0;

    /* Set bytes count of A */
    CRYPTO->AES_GCM_ACNT[0] = alen;
    CRYPTO->AES_GCM_ACNT[1] = 0;

    /* Set bytes count of P/C */
    CRYPTO->AES_GCM_PCNT[0] = plen;
    CRYPTO->AES_GCM_PCNT[1] = 0;


    *plen_aligned = (plen & 0xful) ? ((plen + 16) >> 4) << 4 : plen;

    if (plen < GCM_PBLOCK_SIZE)
    {
        /* Small P/C size, just use DMA one shot */

        /* Prepare the blocked buffer for GCM */
        AES_GCMPacker(iv, ivlen, A, alen, P, plen, g_au8Buf, size);

        printf("input blocks (%d):\n", *size);
        DumpBuffHex(g_au8Buf, *size);

        AES_SetDMATransfer(CRYPTO, 0, (uint32_t)g_au8Buf, (uint32_t)buf, *size);
        AES_Run(u32OptBasic | GCM_MODE | DMAEN);

        printf("output blocks (%d):\n", *size);
        DumpBuffHex(buf, *size);
    }
    else
    {
        /* Decrypt C data block by block. DMA cascade mode. */
        /* Process P block by block, DMA casecade mode */

        /* inital DMA for AES-GCM casecade */

        /* Prepare the blocked buffer for GCM */
        AES_GCMPacker(iv, ivlen, A, alen, 0, 0, g_au8Buf, size);

        printf("input blocks for casecade 0 (%d):\n", *size);
        DumpBuffHex(g_au8Buf, *size);

        AES_SetDMATransfer(CRYPTO, 0, (uint32_t)g_au8Buf, (uint32_t)buf, *size);
        /* feedback buffer is necessary for casecade mode */
        CRYPTO->AES_FBADDR = (uint32_t)&g_au8FeedBackBuf[0];

        AES_Run(u32OptBasic | GCM_MODE | FBOUT | DMAEN);

        /* Start to decrypt P data */
        printf("P Block size for casecade mode %d\n", GCM_PBLOCK_SIZE);
        plen_cur = plen;
        pin = P;
        pout = buf;

        while (plen_cur)
        {
            len = plen_cur;

            if (len > GCM_PBLOCK_SIZE)
            {
                len = GCM_PBLOCK_SIZE;
            }

            plen_cur -= len;

            /* Prepare the blocked buffer for GCM */
            memcpy(g_au8Buf, pin, len);

            /* padding 0 if necessary */
            if (len & 0xf)
            {
                memset(&g_au8Buf[len], 0, 16 - (len & 0xf));
                len = ((len + 16) >> 4) << 4;
            }

            printf("input blocks for casecade (%d):\n", len);
            DumpBuffHex(g_au8Buf, len);

            AES_SetDMATransfer(CRYPTO, 0, (uint32_t)g_au8Buf, (uint32_t)pout, len);

            if (plen_cur)
            {
                /* casecade n */
                AES_Run(u32OptBasic | GCM_MODE | FBIN | FBOUT | DMAEN | DMACC);
            }
            else
            {
                /* last casecade */
                AES_Run(u32OptBasic | GCM_MODE | FBIN | FBOUT | DMAEN | DMACC | DMALAST);
            }

            printf("output blocks (%d):\n", len);
            DumpBuffHex(pout, len);

            pin += len;
            pout += len;
        }
    }


    return 0;
}


/*-----------------------------------------------------------------------------*/
int main(void)
{
    int i, n;
    uint32_t size, klen, plen, tlen, plen_aligned, alen, ivlen;

    // Enable ETM
    SET_TRACE_CLK_PE12();
    SET_TRACE_DATA0_PE11();
    SET_TRACE_DATA1_PE10();
    SET_TRACE_DATA2_PE9();
    SET_TRACE_DATA3_PE8();


    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O. */
    SYS_Init();

    /* Init Debug UART for printf */
    InitDebugUart();
    /* Lock protected registers */
    SYS_LockReg();

    printf("+---------------------------------------+\n");
    printf("|               AES GCM Test            |\n");
    printf("+---------------------------------------+\n");

    NVIC_EnableIRQ(CRYPTO_IRQn);

    n = sizeof(sElements) / sizeof(GCM_TEST_T);

    for (i = 0; i < n; i++)
    {

        printf("\n============================================================================\n");
        printf("Test iter %d/%d\n\n", i + 1, n);

        /* Reset CRYPTO module clock */
        SYS_ResetModule(SYS_CRYPTO0RST);

        AES_ENABLE_INT(CRYPTO);

        printf("key = %s\n", sElements[i].pchKey);
        printf("iv  = %s\n", sElements[i].pchIV);
        printf("A   = %s\n", sElements[i].pchA);
        printf("P   = %s\n", sElements[i].pchP);

        klen = strlen(sElements[i].pchKey) / 2;
        ivlen = strlen(sElements[i].pchIV) / 2;
        alen = strlen(sElements[i].pchA) / 2;
        plen = strlen(sElements[i].pchP) / 2;
        tlen = strlen(sElements[i].pchTag) / 2;

        /* Rule check */
        if ((klen != 16) && (klen != 24) && (klen != 32))
        {
            printf("klen = %d\n", klen);
            printf("Key size should 128, 192 or 256 bits\n");
            return -1;
        }

        if (alen > GCM_PBLOCK_SIZE)
        {
            printf("alen = %d\n", alen);
            printf("length of A should not larger than defined block size.\n");
            return -1;
        }

        if (GCM_PBLOCK_SIZE & 0xf)
        {
            printf("block size = %d\n", GCM_PBLOCK_SIZE);
            printf("Defined block size should be 16 bytes alignment.\n");
            return -1;
        }

        if (ivlen == 0)
        {
            printf("ivlen = %d\n", ivlen);
            printf("IV length should not be 0\n");
            return -1;
        }


        str2bin(sElements[i].pchKey, g_key, klen);
        str2bin(sElements[i].pchIV, g_iv, ivlen);
        str2bin(sElements[i].pchA, g_A, alen);
        str2bin(sElements[i].pchP, g_P, plen);

        AES_GCMEnc(g_key, klen, g_iv, ivlen, g_A, alen, g_P, plen, g_au8Out, &size, &plen_aligned);

        printf("C=%s\n", sElements[i].pchC);
        printf("T=%s\n", sElements[i].pchTag);

        str2bin(sElements[i].pchC, g_C, plen);
        str2bin(sElements[i].pchTag, g_T, tlen);

        if (memcmp(g_C, g_au8Out, plen))
        {
            printf("ERR: Encrypted data fail!\n");
            return -1;
        }

        if (memcmp(g_T, &g_au8Out[plen_aligned], tlen))
        {

            printf("ERR: Tag fail!\n");
            printf("tlen = %d\n", tlen);
            DumpBuffHex(&g_au8Out[plen_aligned], tlen);

            return -1;
        }

        AES_GCMDec(g_key, klen, g_iv, ivlen, g_A, alen, g_au8Out, plen, g_au8Out2, &size, &plen_aligned);

        if (memcmp(g_P, g_au8Out2, plen))
        {
            printf("ERR: Encrypted data fail!\n");
            return -1;
        }

        if (memcmp(g_T, &g_au8Out2[plen_aligned], tlen))
        {
            printf("ERR: Tag fail!");
            return -1;
        }

        printf("Test PASS!\n");

    }

    while (1) {}

}
/*** (C) COPYRIGHT 2023 Nuvoton Technology Corp. ***/
